//
//  UIColor+WHDColor.m
//  WHDcolor
//
//  Created by HUN on 16/9/2.
//  Copyright © 2016年 com.hundred.sdk. All rights reserved.
//

#import "UIColor+WHDColor.h"
static NSArray const *colorArr ;
@implementation UIColor (WHDColor)

+(UIColor *)whd_color:(WHDCOLORTYPE)color
{
    colorArr = @[
                 @[@255,@182,@193],//浅粉红
                 @[@255,@192,@203],//粉红
                 @[@220,@20,@60],//猩红
                 @[@255,@240,@245],//脸红的淡紫色
                  @[@219,@112,@147],//苍白的紫罗兰红色
                  @[@255,@105,@180],//热情的粉红
                  @[@255,@20,@147],//深粉色
                  @[@199,@21,@133],//适中的紫罗兰红色
                  @[@218,@112,@214],//兰花的紫色
                  @[@216,@191,@216],//蓟
                  @[@221,@160,@221],//李子
                  @[@238,@130,@238],//紫罗兰
                  @[@255,@0,@255],//灯笼海棠(紫红色)
                  @[@139,@0,@139],//深洋红色
                  @[@128,@0,@128],//紫色
                  @[@186,@85,@211],//适中的兰花紫
                  @[@148,@0,@211],//深紫罗兰色
                  @[@153,@50,@204],//深兰花紫
                  @[@75,@0,@130],//靛青
                  @[@138,@43,@226],//深紫罗兰的蓝色
                  @[@147,@112,@219],//适中的紫色
                  @[@123,@104,@238],//适中的板岩暗蓝灰色
                  @[@106,@90,@205],//板岩暗蓝灰色
                  @[@72,@61,@139],//深岩暗蓝灰色
                  @[@230,@230,@250],//熏衣草花的淡紫色
                  @[@248,@248,@255],//幽灵的白色
                  @[@0,@0,@255],//纯蓝
                  @[@0,@0,@205],//适中的蓝色
                  @[@25,@25,@112],//午夜的蓝色
                  @[@0,@0,@139],//深蓝色
                  @[@0,@0,@128],//海军蓝
                  @[@65,@105,@225],//皇军蓝
                  @[@100,@149,@237],//矢车菊的蓝色
                  @[@176,@196,@222],//淡钢蓝
                  @[@119,@136,@153],//浅石板灰
                  @[@112,@128,@144],//石板灰
                  @[@30,@144,@255],//道奇蓝
                  @[@240,@248,@255],//爱丽丝蓝
                  @[@70,@130,@180],//钢蓝
                  @[@135,@206,@250],//淡蓝色
                  @[@135,@206,@235],//天蓝色
                  @[@0,@191,@255],//深天蓝
                  @[@173,@216,@230],//淡蓝
                  @[@176,@224,@230],//火药蓝
                  @[@95,@158,@160],//军校蓝
                  @[@240,@255,@255],//蔚蓝色
                  @[@225,@255,@255],//淡青色
                  @[@175,@238,@238],//苍白的绿宝石
                 ];
    NSArray *mycolor = colorArr[color];
    CGFloat R = [mycolor[0] integerValue]/255.0;
    CGFloat G = [mycolor[1] integerValue]/255.0;
    CGFloat B = [mycolor[2] integerValue]/255.0;
    return [UIColor colorWithRed:R green:G blue:B alpha:1];
    
}


@end
